CommunityGD32Cores/ArduinoCore-GD32/boards.txt
# Optimizations
gd_generic_gd32e23x.menu.opt.osstd=Smallest (default)
gd_generic_gd32e23x.menu.opt.o1std=Fast (-O1)
gd_generic_gd32e23x.menu.opt.o1std.build.flags.optimize=-O1
gd_generic_gd32e23x.menu.opt.o1std.build.flags.ldspecs=
gd_generic_gd32e23x.menu.opt.o2std=Faster (-O2)
gd_generic_gd32e23x.menu.opt.o2std.build.flags.optimize=-O2
gd_generic_gd32e23x.menu.opt.o2std.build.flags.ldspecs=
gd_generic_gd32e23x.menu.opt.o3std=Fastest (-O3)
gd_generic_gd32e23x.menu.opt.o3std.build.flags.optimize=-O3
gd_generic_gd32e23x.menu.opt.o3std.build.flags.ldspecs=
gd_generic_gd32e23x.menu.opt.ogstd=Debug (-Og)
gd_generic_gd32e23x.menu.opt.ogstd.build.flags.optimize=-Og
gd_generic_gd32e23x.menu.opt.ogstd.build.flags.ldspecs=

##################################################
# Generic GD32F1x0
gd_generic_gd32f1x0.name=GD32F1x0 Generic series
gd_generic_gd32f1x0.build.core=arduino
gd_generic_gd32f1x0.build.board=gd_generic_gd32f1x0
gd_generic_gd32f1x0.build.mcu=cortex-m3
gd_generic_gd32f1x0.build.series=GD32F1x0

gd_generic_gd32f1x0.build.vid=0xdead
gd_generic_gd32f1x0.build.pid=0xbeef
gd_generic_gd32f1x0.build.usb_product="USB Test"
gd_generic_gd32f1x0.build.usb_manufacturer="Arduino"

# create a new entry each board here
gd_generic_gd32f1x0.menu.pnum.GD32F130C4_GENERIC=GD32F130C4 (Generic)
gd_generic_gd32f1x0.menu.pnum.GD32F130C4_GENERIC.upload.maximum_size=16384
gd_generic_gd32f1x0.menu.pnum.GD32F130C4_GENERIC.upload.maximum_data_size=4096
gd_generic_gd32f1x0.menu.pnum.GD32F130C4_GENERIC.build.board=GD32F130C4_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F130C4_GENERIC.build.series=GD32F1x0
gd_generic_gd32f1x0.menu.pnum.GD32F130C4_GENERIC.build.product_line=GD32F130_150
gd_generic_gd32f1x0.menu.pnum.GD32F130C4_GENERIC.build.variant=GD32F130C4_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F130C4_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f1x0.menu.pnum.GD32F130C6_GENERIC=GD32F130C6 (Generic)
gd_generic_gd32f1x0.menu.pnum.GD32F130C6_GENERIC.upload.maximum_size=32768
gd_generic_gd32f1x0.menu.pnum.GD32F130C6_GENERIC.upload.maximum_data_size=4096
gd_generic_gd32f1x0.menu.pnum.GD32F130C6_GENERIC.build.board=GD32F130C6_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F130C6_GENERIC.build.series=GD32F1x0
gd_generic_gd32f1x0.menu.pnum.GD32F130C6_GENERIC.build.product_line=GD32F130_150
gd_generic_gd32f1x0.menu.pnum.GD32F130C6_GENERIC.build.variant=GD32F130C6_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F130C6_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f1x0.menu.pnum.GD32F130C8_GENERIC=GD32F130C8 (Generic)
gd_generic_gd32f1x0.menu.pnum.GD32F130C8_GENERIC.upload.maximum_size=65536
gd_generic_gd32f1x0.menu.pnum.GD32F130C8_GENERIC.upload.maximum_data_size=8192
gd_generic_gd32f1x0.menu.pnum.GD32F130C8_GENERIC.build.board=GD32F130C8_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F130C8_GENERIC.build.series=GD32F1x0
gd_generic_gd32f1x0.menu.pnum.GD32F130C8_GENERIC.build.product_line=GD32F130_150
gd_generic_gd32f1x0.menu.pnum.GD32F130C8_GENERIC.build.variant=GD32F130C8_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F130C8_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f1x0.menu.pnum.GD32F130F4_GENERIC=GD32F130F4 (Generic)
gd_generic_gd32f1x0.menu.pnum.GD32F130F4_GENERIC.upload.maximum_size=16384
gd_generic_gd32f1x0.menu.pnum.GD32F130F4_GENERIC.upload.maximum_data_size=4096
gd_generic_gd32f1x0.menu.pnum.GD32F130F4_GENERIC.build.board=GD32F130F4_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F130F4_GENERIC.build.series=GD32F1x0
gd_generic_gd32f1x0.menu.pnum.GD32F130F4_GENERIC.build.product_line=GD32F130_150
gd_generic_gd32f1x0.menu.pnum.GD32F130F4_GENERIC.build.variant=GD32F130F4_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F130F4_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f1x0.menu.pnum.GD32F130F6_GENERIC=GD32F130F6 (Generic)
gd_generic_gd32f1x0.menu.pnum.GD32F130F6_GENERIC.upload.maximum_size=32768
gd_generic_gd32f1x0.menu.pnum.GD32F130F6_GENERIC.upload.maximum_data_size=4096
gd_generic_gd32f1x0.menu.pnum.GD32F130F6_GENERIC.build.board=GD32F130F6_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F130F6_GENERIC.build.series=GD32F1x0
gd_generic_gd32f1x0.menu.pnum.GD32F130F6_GENERIC.build.product_line=GD32F130_150
gd_generic_gd32f1x0.menu.pnum.GD32F130F6_GENERIC.build.variant=GD32F130F6_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F130F6_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f1x0.menu.pnum.GD32F130F8_GENERIC=GD32F130F8 (Generic)
gd_generic_gd32f1x0.menu.pnum.GD32F130F8_GENERIC.upload.maximum_size=65536
gd_generic_gd32f1x0.menu.pnum.GD32F130F8_GENERIC.upload.maximum_data_size=8192
gd_generic_gd32f1x0.menu.pnum.GD32F130F8_GENERIC.build.board=GD32F130F8_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F130F8_GENERIC.build.series=GD32F1x0
gd_generic_gd32f1x0.menu.pnum.GD32F130F8_GENERIC.build.product_line=GD32F130_150
gd_generic_gd32f1x0.menu.pnum.GD32F130F8_GENERIC.build.variant=GD32F130F8_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F130F8_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f1x0.menu.pnum.GD32F130G4_GENERIC=GD32F130G4 (Generic)
gd_generic_gd32f1x0.menu.pnum.GD32F130G4_GENERIC.upload.maximum_size=16384
gd_generic_gd32f1x0.menu.pnum.GD32F130G4_GENERIC.upload.maximum_data_size=4096
gd_generic_gd32f1x0.menu.pnum.GD32F130G4_GENERIC.build.board=GD32F130G4_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F130G4_GENERIC.build.series=GD32F1x0
gd_generic_gd32f1x0.menu.pnum.GD32F130G4_GENERIC.build.product_line=GD32F130_150
gd_generic_gd32f1x0.menu.pnum.GD32F130G4_GENERIC.build.variant=GD32F130G4_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F130G4_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f1x0.menu.pnum.GD32F130G6_GENERIC=GD32F130G6 (Generic)
gd_generic_gd32f1x0.menu.pnum.GD32F130G6_GENERIC.upload.maximum_size=32768
gd_generic_gd32f1x0.menu.pnum.GD32F130G6_GENERIC.upload.maximum_data_size=4096
gd_generic_gd32f1x0.menu.pnum.GD32F130G6_GENERIC.build.board=GD32F130G6_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F130G6_GENERIC.build.series=GD32F1x0
gd_generic_gd32f1x0.menu.pnum.GD32F130G6_GENERIC.build.product_line=GD32F130_150
gd_generic_gd32f1x0.menu.pnum.GD32F130G6_GENERIC.build.variant=GD32F130G6_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F130G6_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f1x0.menu.pnum.GD32F130G8_GENERIC=GD32F130G8 (Generic)
gd_generic_gd32f1x0.menu.pnum.GD32F130G8_GENERIC.upload.maximum_size=65536
gd_generic_gd32f1x0.menu.pnum.GD32F130G8_GENERIC.upload.maximum_data_size=8192
gd_generic_gd32f1x0.menu.pnum.GD32F130G8_GENERIC.build.board=GD32F130G8_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F130G8_GENERIC.build.series=GD32F1x0
gd_generic_gd32f1x0.menu.pnum.GD32F130G8_GENERIC.build.product_line=GD32F130_150
gd_generic_gd32f1x0.menu.pnum.GD32F130G8_GENERIC.build.variant=GD32F130G8_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F130G8_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f1x0.menu.pnum.GD32F130K4_GENERIC=GD32F130K4 (Generic)
gd_generic_gd32f1x0.menu.pnum.GD32F130K4_GENERIC.upload.maximum_size=16384
gd_generic_gd32f1x0.menu.pnum.GD32F130K4_GENERIC.upload.maximum_data_size=4096
gd_generic_gd32f1x0.menu.pnum.GD32F130K4_GENERIC.build.board=GD32F130K4_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F130K4_GENERIC.build.series=GD32F1x0
gd_generic_gd32f1x0.menu.pnum.GD32F130K4_GENERIC.build.product_line=GD32F130_150
gd_generic_gd32f1x0.menu.pnum.GD32F130K4_GENERIC.build.variant=GD32F130K4_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F130K4_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f1x0.menu.pnum.GD32F130K6_GENERIC=GD32F130K6 (Generic)
gd_generic_gd32f1x0.menu.pnum.GD32F130K6_GENERIC.upload.maximum_size=32768
gd_generic_gd32f1x0.menu.pnum.GD32F130K6_GENERIC.upload.maximum_data_size=4096
gd_generic_gd32f1x0.menu.pnum.GD32F130K6_GENERIC.build.board=GD32F130K6_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F130K6_GENERIC.build.series=GD32F1x0
gd_generic_gd32f1x0.menu.pnum.GD32F130K6_GENERIC.build.product_line=GD32F130_150
gd_generic_gd32f1x0.menu.pnum.GD32F130K6_GENERIC.build.variant=GD32F130K6_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F130K6_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f1x0.menu.pnum.GD32F130K8_GENERIC=GD32F130K8 (Generic)
gd_generic_gd32f1x0.menu.pnum.GD32F130K8_GENERIC.upload.maximum_size=65536
gd_generic_gd32f1x0.menu.pnum.GD32F130K8_GENERIC.upload.maximum_data_size=8192
gd_generic_gd32f1x0.menu.pnum.GD32F130K8_GENERIC.build.board=GD32F130K8_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F130K8_GENERIC.build.series=GD32F1x0
gd_generic_gd32f1x0.menu.pnum.GD32F130K8_GENERIC.build.product_line=GD32F130_150
gd_generic_gd32f1x0.menu.pnum.GD32F130K8_GENERIC.build.variant=GD32F130K8_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F130K8_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f1x0.menu.pnum.GD32F130R8_GENERIC=GD32F130R8 (Generic)
gd_generic_gd32f1x0.menu.pnum.GD32F130R8_GENERIC.upload.maximum_size=65536
gd_generic_gd32f1x0.menu.pnum.GD32F130R8_GENERIC.upload.maximum_data_size=8192
gd_generic_gd32f1x0.menu.pnum.GD32F130R8_GENERIC.build.board=GD32F130R8_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F130R8_GENERIC.build.series=GD32F1x0
gd_generic_gd32f1x0.menu.pnum.GD32F130R8_GENERIC.build.product_line=GD32F130_150
gd_generic_gd32f1x0.menu.pnum.GD32F130R8_GENERIC.build.variant=GD32F130R8_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F130R8_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f1x0.menu.pnum.GD32F150C4_GENERIC=GD32F150C4 (Generic)
gd_generic_gd32f1x0.menu.pnum.GD32F150C4_GENERIC.upload.maximum_size=16384
gd_generic_gd32f1x0.menu.pnum.GD32F150C4_GENERIC.upload.maximum_data_size=4096
gd_generic_gd32f1x0.menu.pnum.GD32F150C4_GENERIC.build.board=GD32F150C4_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F150C4_GENERIC.build.series=GD32F1x0
gd_generic_gd32f1x0.menu.pnum.GD32F150C4_GENERIC.build.product_line=GD32F130_150
gd_generic_gd32f1x0.menu.pnum.GD32F150C4_GENERIC.build.variant=GD32F150C4_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F150C4_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f1x0.menu.pnum.GD32F150C6_GENERIC=GD32F150C6 (Generic)
gd_generic_gd32f1x0.menu.pnum.GD32F150C6_GENERIC.upload.maximum_size=32768
gd_generic_gd32f1x0.menu.pnum.GD32F150C6_GENERIC.upload.maximum_data_size=6144
gd_generic_gd32f1x0.menu.pnum.GD32F150C6_GENERIC.build.board=GD32F150C6_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F150C6_GENERIC.build.series=GD32F1x0
gd_generic_gd32f1x0.menu.pnum.GD32F150C6_GENERIC.build.product_line=GD32F130_150
gd_generic_gd32f1x0.menu.pnum.GD32F150C6_GENERIC.build.variant=GD32F150C6_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F150C6_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f1x0.menu.pnum.GD32F150C8_GENERIC=GD32F150C8 (Generic)
gd_generic_gd32f1x0.menu.pnum.GD32F150C8_GENERIC.upload.maximum_size=65536
gd_generic_gd32f1x0.menu.pnum.GD32F150C8_GENERIC.upload.maximum_data_size=8192
gd_generic_gd32f1x0.menu.pnum.GD32F150C8_GENERIC.build.board=GD32F150C8_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F150C8_GENERIC.build.series=GD32F1x0
gd_generic_gd32f1x0.menu.pnum.GD32F150C8_GENERIC.build.product_line=GD32F130_150
gd_generic_gd32f1x0.menu.pnum.GD32F150C8_GENERIC.build.variant=GD32F150C8_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F150C8_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f1x0.menu.pnum.GD32F150G4_GENERIC=GD32F150G4 (Generic)
gd_generic_gd32f1x0.menu.pnum.GD32F150G4_GENERIC.upload.maximum_size=16384
gd_generic_gd32f1x0.menu.pnum.GD32F150G4_GENERIC.upload.maximum_data_size=4096
gd_generic_gd32f1x0.menu.pnum.GD32F150G4_GENERIC.build.board=GD32F150G4_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F150G4_GENERIC.build.series=GD32F1x0
gd_generic_gd32f1x0.menu.pnum.GD32F150G4_GENERIC.build.product_line=GD32F130_150
gd_generic_gd32f1x0.menu.pnum.GD32F150G4_GENERIC.build.variant=GD32F150G4_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F150G4_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f1x0.menu.pnum.GD32F150G6_GENERIC=GD32F150G6 (Generic)
gd_generic_gd32f1x0.menu.pnum.GD32F150G6_GENERIC.upload.maximum_size=32768
gd_generic_gd32f1x0.menu.pnum.GD32F150G6_GENERIC.upload.maximum_data_size=6144
gd_generic_gd32f1x0.menu.pnum.GD32F150G6_GENERIC.build.board=GD32F150G6_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F150G6_GENERIC.build.series=GD32F1x0
gd_generic_gd32f1x0.menu.pnum.GD32F150G6_GENERIC.build.product_line=GD32F130_150
gd_generic_gd32f1x0.menu.pnum.GD32F150G6_GENERIC.build.variant=GD32F150G6_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F150G6_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f1x0.menu.pnum.GD32F150G8_GENERIC=GD32F150G8 (Generic)
gd_generic_gd32f1x0.menu.pnum.GD32F150G8_GENERIC.upload.maximum_size=65536
gd_generic_gd32f1x0.menu.pnum.GD32F150G8_GENERIC.upload.maximum_data_size=8192
gd_generic_gd32f1x0.menu.pnum.GD32F150G8_GENERIC.build.board=GD32F150G8_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F150G8_GENERIC.build.series=GD32F1x0
gd_generic_gd32f1x0.menu.pnum.GD32F150G8_GENERIC.build.product_line=GD32F130_150
gd_generic_gd32f1x0.menu.pnum.GD32F150G8_GENERIC.build.variant=GD32F150G8_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F150G8_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f1x0.menu.pnum.GD32F150K4_GENERIC=GD32F150K4 (Generic)
gd_generic_gd32f1x0.menu.pnum.GD32F150K4_GENERIC.upload.maximum_size=16384
gd_generic_gd32f1x0.menu.pnum.GD32F150K4_GENERIC.upload.maximum_data_size=4096
gd_generic_gd32f1x0.menu.pnum.GD32F150K4_GENERIC.build.board=GD32F150K4_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F150K4_GENERIC.build.series=GD32F1x0
gd_generic_gd32f1x0.menu.pnum.GD32F150K4_GENERIC.build.product_line=GD32F130_150
gd_generic_gd32f1x0.menu.pnum.GD32F150K4_GENERIC.build.variant=GD32F150K4_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F150K4_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f1x0.menu.pnum.GD32F150K6_GENERIC=GD32F150K6 (Generic)
gd_generic_gd32f1x0.menu.pnum.GD32F150K6_GENERIC.upload.maximum_size=32768
gd_generic_gd32f1x0.menu.pnum.GD32F150K6_GENERIC.upload.maximum_data_size=6144
gd_generic_gd32f1x0.menu.pnum.GD32F150K6_GENERIC.build.board=GD32F150K6_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F150K6_GENERIC.build.series=GD32F1x0
gd_generic_gd32f1x0.menu.pnum.GD32F150K6_GENERIC.build.product_line=GD32F130_150
gd_generic_gd32f1x0.menu.pnum.GD32F150K6_GENERIC.build.variant=GD32F150K6_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F150K6_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f1x0.menu.pnum.GD32F150K8_GENERIC=GD32F150K8 (Generic)
gd_generic_gd32f1x0.menu.pnum.GD32F150K8_GENERIC.upload.maximum_size=65536
gd_generic_gd32f1x0.menu.pnum.GD32F150K8_GENERIC.upload.maximum_data_size=8192
gd_generic_gd32f1x0.menu.pnum.GD32F150K8_GENERIC.build.board=GD32F150K8_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F150K8_GENERIC.build.series=GD32F1x0
gd_generic_gd32f1x0.menu.pnum.GD32F150K8_GENERIC.build.product_line=GD32F130_150
gd_generic_gd32f1x0.menu.pnum.GD32F150K8_GENERIC.build.variant=GD32F150K8_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F150K8_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f1x0.menu.pnum.GD32F150R4_GENERIC=GD32F150R4 (Generic)
gd_generic_gd32f1x0.menu.pnum.GD32F150R4_GENERIC.upload.maximum_size=16384
gd_generic_gd32f1x0.menu.pnum.GD32F150R4_GENERIC.upload.maximum_data_size=4096
gd_generic_gd32f1x0.menu.pnum.GD32F150R4_GENERIC.build.board=GD32F150R4_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F150R4_GENERIC.build.series=GD32F1x0
gd_generic_gd32f1x0.menu.pnum.GD32F150R4_GENERIC.build.product_line=GD32F130_150
gd_generic_gd32f1x0.menu.pnum.GD32F150R4_GENERIC.build.variant=GD32F150R4_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F150R4_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f1x0.menu.pnum.GD32F150R6_GENERIC=GD32F150R6 (Generic)
gd_generic_gd32f1x0.menu.pnum.GD32F150R6_GENERIC.upload.maximum_size=32768
gd_generic_gd32f1x0.menu.pnum.GD32F150R6_GENERIC.upload.maximum_data_size=6144
gd_generic_gd32f1x0.menu.pnum.GD32F150R6_GENERIC.build.board=GD32F150R6_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F150R6_GENERIC.build.series=GD32F1x0
gd_generic_gd32f1x0.menu.pnum.GD32F150R6_GENERIC.build.product_line=GD32F130_150
gd_generic_gd32f1x0.menu.pnum.GD32F150R6_GENERIC.build.variant=GD32F150R6_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F150R6_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f1x0.menu.pnum.GD32F150R8_GENERIC=GD32F150R8 (Generic)
gd_generic_gd32f1x0.menu.pnum.GD32F150R8_GENERIC.upload.maximum_size=65536
gd_generic_gd32f1x0.menu.pnum.GD32F150R8_GENERIC.upload.maximum_data_size=8192
gd_generic_gd32f1x0.menu.pnum.GD32F150R8_GENERIC.build.board=GD32F150R8_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F150R8_GENERIC.build.series=GD32F1x0
gd_generic_gd32f1x0.menu.pnum.GD32F150R8_GENERIC.build.product_line=GD32F130_150
gd_generic_gd32f1x0.menu.pnum.GD32F150R8_GENERIC.build.variant=GD32F150R8_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F150R8_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f1x0.menu.pnum.GD32F170C4_GENERIC=GD32F170C4 (Generic)
gd_generic_gd32f1x0.menu.pnum.GD32F170C4_GENERIC.upload.maximum_size=16384
gd_generic_gd32f1x0.menu.pnum.GD32F170C4_GENERIC.upload.maximum_data_size=4096
gd_generic_gd32f1x0.menu.pnum.GD32F170C4_GENERIC.build.board=GD32F170C4_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F170C4_GENERIC.build.series=GD32F1x0
gd_generic_gd32f1x0.menu.pnum.GD32F170C4_GENERIC.build.product_line=GD32F170_190
gd_generic_gd32f1x0.menu.pnum.GD32F170C4_GENERIC.build.variant=GD32F170C4_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F170C4_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f1x0.menu.pnum.GD32F170C6_GENERIC=GD32F170C6 (Generic)
gd_generic_gd32f1x0.menu.pnum.GD32F170C6_GENERIC.upload.maximum_size=32768
gd_generic_gd32f1x0.menu.pnum.GD32F170C6_GENERIC.upload.maximum_data_size=4096
gd_generic_gd32f1x0.menu.pnum.GD32F170C6_GENERIC.build.board=GD32F170C6_GENERIC
gd_generic_gd32f1x0.menu.pnum.GD32F170C6_GENERIC.build.series=GD32F1x0
