CommunityGD32Cores/ArduinoCore-GD32/boards.txt
# Optimizations
gd_generic_gd32f1x0.menu.opt.osstd=Smallest (default)
gd_generic_gd32f1x0.menu.opt.o1std=Fast (-O1)
gd_generic_gd32f1x0.menu.opt.o1std.build.flags.optimize=-O1
gd_generic_gd32f1x0.menu.opt.o1std.build.flags.ldspecs=
gd_generic_gd32f1x0.menu.opt.o2std=Faster (-O2)
gd_generic_gd32f1x0.menu.opt.o2std.build.flags.optimize=-O2
gd_generic_gd32f1x0.menu.opt.o2std.build.flags.ldspecs=
gd_generic_gd32f1x0.menu.opt.o3std=Fastest (-O3)
gd_generic_gd32f1x0.menu.opt.o3std.build.flags.optimize=-O3
gd_generic_gd32f1x0.menu.opt.o3std.build.flags.ldspecs=
gd_generic_gd32f1x0.menu.opt.ogstd=Debug (-Og)
gd_generic_gd32f1x0.menu.opt.ogstd.build.flags.optimize=-Og
gd_generic_gd32f1x0.menu.opt.ogstd.build.flags.ldspecs=

##################################################
# Generic GD32F30x
gd_generic_gd32f30x.name=GD32F30x Generic series
gd_generic_gd32f30x.build.core=arduino
gd_generic_gd32f30x.build.board=gd_generic_gd32f30x
gd_generic_gd32f30x.build.mcu=cortex-m4
gd_generic_gd32f30x.build.series=GD32F30x

gd_generic_gd32f30x.build.vid=0xdead
gd_generic_gd32f30x.build.pid=0xbeef
gd_generic_gd32f30x.build.usb_product="USB Test"
gd_generic_gd32f30x.build.usb_manufacturer="Arduino"

# create a new entry each board here
gd_generic_gd32f30x.menu.pnum.GD32F303CC_GENERIC=GD32F303CC (Generic)
gd_generic_gd32f30x.menu.pnum.GD32F303CC_GENERIC.upload.maximum_size=262144
gd_generic_gd32f30x.menu.pnum.GD32F303CC_GENERIC.upload.maximum_data_size=49152
gd_generic_gd32f30x.menu.pnum.GD32F303CC_GENERIC.build.board=GD32F303CC_GENERIC
gd_generic_gd32f30x.menu.pnum.GD32F303CC_GENERIC.build.series=GD32F30x
gd_generic_gd32f30x.menu.pnum.GD32F303CC_GENERIC.build.product_line=GD32F30X_HD
gd_generic_gd32f30x.menu.pnum.GD32F303CC_GENERIC.build.variant=GD32F303CC_GENERIC
gd_generic_gd32f30x.menu.pnum.GD32F303CC_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f30x.menu.usb.off=Off
gd_generic_gd32f30x.menu.usb.on=On
gd_generic_gd32f30x.menu.usb.on.build.enable_usb={build.usb_flags} -DUSBCON -DUSBD_USE_CDC

# Upload menu
gd_generic_gd32f30x.menu.upload_method.serialMethod=gd32flash (Serial)
gd_generic_gd32f30x.menu.upload_method.serialMethod.upload.protocol=maple_serial
gd_generic_gd32f30x.menu.upload_method.serialMethod.upload.options=
gd_generic_gd32f30x.menu.upload_method.serialMethod.build.upload_flags=-DCONFIG_MAPLE_MINI_NO_DISABLE_DEBUG=1
gd_generic_gd32f30x.menu.upload_method.serialMethod.upload.tool=serial_upload

gd_generic_gd32f30x.menu.upload_method.gdlinkMethod=GDlink (SWD)
gd_generic_gd32f30x.menu.upload_method.gdlinkMethod.upload.protocol=gdlink
gd_generic_gd32f30x.menu.upload_method.gdlinkMethod.upload.options=
gd_generic_gd32f30x.menu.upload_method.gdlinkMethod.build.upload_flags=-DCONFIG_MAPLE_MINI_NO_DISABLE_DEBUG=1 -DSERIAL_USB -DGENERIC_BOOTLOADER
gd_generic_gd32f30x.menu.upload_method.gdlinkMethod.upload.tool=gdlink_upload

gd_generic_gd32f30x.menu.upload_method.stlinkMethod=STLink (SWD)
gd_generic_gd32f30x.menu.upload_method.stlinkMethod.upload.protocol=stlink
gd_generic_gd32f30x.menu.upload_method.stlinkMethod.upload.options=
gd_generic_gd32f30x.menu.upload_method.stlinkMethod.build.upload_flags=-DCONFIG_MAPLE_MINI_NO_DISABLE_DEBUG=1 -DSERIAL_USB -DGENERIC_BOOTLOADER
gd_generic_gd32f30x.menu.upload_method.stlinkMethod.upload.tool=stlink_upload

gd_generic_gd32f30x.menu.upload_method.jlinkMethod=JLink (SWD)
gd_generic_gd32f30x.menu.upload_method.jlinkMethod.upload.protocol=jlink
gd_generic_gd32f30x.menu.upload_method.jlinkMethod.upload.options=
gd_generic_gd32f30x.menu.upload_method.jlinkMethod.build.upload_flags=-DCONFIG_MAPLE_MINI_NO_DISABLE_DEBUG=1 -DSERIAL_USB -DGENERIC_BOOTLOADER
gd_generic_gd32f30x.menu.upload_method.jlinkMethod.upload.tool=jlink_upload

gd_generic_gd32f30x.menu.upload_method.dfuUtilMethod=dfu-util (DFU - STMDuino bootloader)
gd_generic_gd32f30x.menu.upload_method.dfuUtilMethod.upload.protocol=dfu
gd_generic_gd32f30x.menu.upload_method.dfuUtilMethod.upload.options=
gd_generic_gd32f30x.menu.upload_method.dfuUtilMethod.build.upload_flags=
gd_generic_gd32f30x.menu.upload_method.dfuUtilMethod.upload.tool=dfu-util

gd_generic_gd32f30x.menu.upload_method.dfuUtilMethod.build.flash_offset=0x0x2000
gd_generic_gd32f30x.menu.upload_method.dfuUtilMethod.upload.pid=0x004
gd_generic_gd32f30x.menu.upload_method.dfuUtilMethod.upload.vid=0x1209

# Optimizations
gd_generic_gd32f30x.menu.opt.osstd=Smallest (default)
gd_generic_gd32f30x.menu.opt.o1std=Fast (-O1)
gd_generic_gd32f30x.menu.opt.o1std.build.flags.optimize=-O1
gd_generic_gd32f30x.menu.opt.o1std.build.flags.ldspecs=
gd_generic_gd32f30x.menu.opt.o2std=Faster (-O2)
gd_generic_gd32f30x.menu.opt.o2std.build.flags.optimize=-O2
gd_generic_gd32f30x.menu.opt.o2std.build.flags.ldspecs=
gd_generic_gd32f30x.menu.opt.o3std=Fastest (-O3)
gd_generic_gd32f30x.menu.opt.o3std.build.flags.optimize=-O3
gd_generic_gd32f30x.menu.opt.o3std.build.flags.ldspecs=
gd_generic_gd32f30x.menu.opt.ogstd=Debug (-Og)
gd_generic_gd32f30x.menu.opt.ogstd.build.flags.optimize=-Og
gd_generic_gd32f30x.menu.opt.ogstd.build.flags.ldspecs=

##################################################
# Generic GD32F10x
gd_generic_gd32f10x.name=GD32F10x Generic series
gd_generic_gd32f10x.build.core=arduino
gd_generic_gd32f10x.build.board=gd_generic_gd32f10x
gd_generic_gd32f10x.build.mcu=cortex-m3
gd_generic_gd32f10x.build.series=GD32F10x

gd_generic_gd32f10x.build.vid=0xdead
gd_generic_gd32f10x.build.pid=0xbeef
gd_generic_gd32f10x.build.usb_product="USB Test"
gd_generic_gd32f10x.build.usb_manufacturer="Arduino"

# create a new entry each board here
gd_generic_gd32f10x.menu.pnum.GD32F103C4_GENERIC=GD32F103C4 (Generic)
gd_generic_gd32f10x.menu.pnum.GD32F103C4_GENERIC.upload.maximum_size=16384
gd_generic_gd32f10x.menu.pnum.GD32F103C4_GENERIC.upload.maximum_data_size=6144
gd_generic_gd32f10x.menu.pnum.GD32F103C4_GENERIC.build.board=GD32F103C4_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103C4_GENERIC.build.series=GD32F10x
gd_generic_gd32f10x.menu.pnum.GD32F103C4_GENERIC.build.product_line=GD32F10X_MD
gd_generic_gd32f10x.menu.pnum.GD32F103C4_GENERIC.build.variant=GD32F103C4_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103C4_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f10x.menu.pnum.GD32F103C6_GENERIC=GD32F103C6 (Generic)
gd_generic_gd32f10x.menu.pnum.GD32F103C6_GENERIC.upload.maximum_size=32768
gd_generic_gd32f10x.menu.pnum.GD32F103C6_GENERIC.upload.maximum_data_size=10240
gd_generic_gd32f10x.menu.pnum.GD32F103C6_GENERIC.build.board=GD32F103C6_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103C6_GENERIC.build.series=GD32F10x
gd_generic_gd32f10x.menu.pnum.GD32F103C6_GENERIC.build.product_line=GD32F10X_MD
gd_generic_gd32f10x.menu.pnum.GD32F103C6_GENERIC.build.variant=GD32F103C6_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103C6_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f10x.menu.pnum.GD32F103C8_GENERIC=GD32F103C8 (Generic)
gd_generic_gd32f10x.menu.pnum.GD32F103C8_GENERIC.upload.maximum_size=65536
gd_generic_gd32f10x.menu.pnum.GD32F103C8_GENERIC.upload.maximum_data_size=20480
gd_generic_gd32f10x.menu.pnum.GD32F103C8_GENERIC.build.board=GD32F103C8_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103C8_GENERIC.build.series=GD32F10x
gd_generic_gd32f10x.menu.pnum.GD32F103C8_GENERIC.build.product_line=GD32F10X_MD
gd_generic_gd32f10x.menu.pnum.GD32F103C8_GENERIC.build.variant=GD32F103C8_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103C8_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f10x.menu.pnum.GD32F103CB_GENERIC=GD32F103CB (Generic)
gd_generic_gd32f10x.menu.pnum.GD32F103CB_GENERIC.upload.maximum_size=131072
gd_generic_gd32f10x.menu.pnum.GD32F103CB_GENERIC.upload.maximum_data_size=20480
gd_generic_gd32f10x.menu.pnum.GD32F103CB_GENERIC.build.board=GD32F103CB_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103CB_GENERIC.build.series=GD32F10x
gd_generic_gd32f10x.menu.pnum.GD32F103CB_GENERIC.build.product_line=GD32F10X_MD
gd_generic_gd32f10x.menu.pnum.GD32F103CB_GENERIC.build.variant=GD32F103CB_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103CB_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f10x.menu.pnum.GD32F103R4_GENERIC=GD32F103R4 (Generic)
gd_generic_gd32f10x.menu.pnum.GD32F103R4_GENERIC.upload.maximum_size=16384
gd_generic_gd32f10x.menu.pnum.GD32F103R4_GENERIC.upload.maximum_data_size=6144
gd_generic_gd32f10x.menu.pnum.GD32F103R4_GENERIC.build.board=GD32F103R4_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103R4_GENERIC.build.series=GD32F10x
gd_generic_gd32f10x.menu.pnum.GD32F103R4_GENERIC.build.product_line=GD32F10X_MD
gd_generic_gd32f10x.menu.pnum.GD32F103R4_GENERIC.build.variant=GD32F103R4_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103R4_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f10x.menu.pnum.GD32F103R6_GENERIC=GD32F103R6 (Generic)
gd_generic_gd32f10x.menu.pnum.GD32F103R6_GENERIC.upload.maximum_size=32768
gd_generic_gd32f10x.menu.pnum.GD32F103R6_GENERIC.upload.maximum_data_size=10240
gd_generic_gd32f10x.menu.pnum.GD32F103R6_GENERIC.build.board=GD32F103R6_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103R6_GENERIC.build.series=GD32F10x
gd_generic_gd32f10x.menu.pnum.GD32F103R6_GENERIC.build.product_line=GD32F10X_MD
gd_generic_gd32f10x.menu.pnum.GD32F103R6_GENERIC.build.variant=GD32F103R6_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103R6_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f10x.menu.pnum.GD32F103R8_GENERIC=GD32F103R8 (Generic)
gd_generic_gd32f10x.menu.pnum.GD32F103R8_GENERIC.upload.maximum_size=65536
gd_generic_gd32f10x.menu.pnum.GD32F103R8_GENERIC.upload.maximum_data_size=20480
gd_generic_gd32f10x.menu.pnum.GD32F103R8_GENERIC.build.board=GD32F103R8_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103R8_GENERIC.build.series=GD32F10x
gd_generic_gd32f10x.menu.pnum.GD32F103R8_GENERIC.build.product_line=GD32F10X_MD
gd_generic_gd32f10x.menu.pnum.GD32F103R8_GENERIC.build.variant=GD32F103R8_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103R8_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f10x.menu.pnum.GD32F103RB_GENERIC=GD32F103RB (Generic)
gd_generic_gd32f10x.menu.pnum.GD32F103RB_GENERIC.upload.maximum_size=131072
gd_generic_gd32f10x.menu.pnum.GD32F103RB_GENERIC.upload.maximum_data_size=20480
gd_generic_gd32f10x.menu.pnum.GD32F103RB_GENERIC.build.board=GD32F103RB_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103RB_GENERIC.build.series=GD32F10x
gd_generic_gd32f10x.menu.pnum.GD32F103RB_GENERIC.build.product_line=GD32F10X_MD
gd_generic_gd32f10x.menu.pnum.GD32F103RB_GENERIC.build.variant=GD32F103RB_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103RB_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f10x.menu.pnum.GD32F103RC_GENERIC=GD32F103RC (Generic)
gd_generic_gd32f10x.menu.pnum.GD32F103RC_GENERIC.upload.maximum_size=262144
gd_generic_gd32f10x.menu.pnum.GD32F103RC_GENERIC.upload.maximum_data_size=49152
gd_generic_gd32f10x.menu.pnum.GD32F103RC_GENERIC.build.board=GD32F103RC_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103RC_GENERIC.build.series=GD32F10x
gd_generic_gd32f10x.menu.pnum.GD32F103RC_GENERIC.build.product_line=GD32F10X_HD
gd_generic_gd32f10x.menu.pnum.GD32F103RC_GENERIC.build.variant=GD32F103RC_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103RC_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f10x.menu.pnum.GD32F103RD_GENERIC=GD32F103RD (Generic)
gd_generic_gd32f10x.menu.pnum.GD32F103RD_GENERIC.upload.maximum_size=393216
gd_generic_gd32f10x.menu.pnum.GD32F103RD_GENERIC.upload.maximum_data_size=65536
gd_generic_gd32f10x.menu.pnum.GD32F103RD_GENERIC.build.board=GD32F103RD_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103RD_GENERIC.build.series=GD32F10x
gd_generic_gd32f10x.menu.pnum.GD32F103RD_GENERIC.build.product_line=GD32F10X_HD
gd_generic_gd32f10x.menu.pnum.GD32F103RD_GENERIC.build.variant=GD32F103RD_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103RD_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f10x.menu.pnum.GD32F103RE_GENERIC=GD32F103RE (Generic)
gd_generic_gd32f10x.menu.pnum.GD32F103RE_GENERIC.upload.maximum_size=524288
gd_generic_gd32f10x.menu.pnum.GD32F103RE_GENERIC.upload.maximum_data_size=65536
gd_generic_gd32f10x.menu.pnum.GD32F103RE_GENERIC.build.board=GD32F103RE_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103RE_GENERIC.build.series=GD32F10x
gd_generic_gd32f10x.menu.pnum.GD32F103RE_GENERIC.build.product_line=GD32F10X_HD
gd_generic_gd32f10x.menu.pnum.GD32F103RE_GENERIC.build.variant=GD32F103RE_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103RE_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f10x.menu.pnum.GD32F103RF_GENERIC=GD32F103RF (Generic)
gd_generic_gd32f10x.menu.pnum.GD32F103RF_GENERIC.upload.maximum_size=786432
gd_generic_gd32f10x.menu.pnum.GD32F103RF_GENERIC.upload.maximum_data_size=98304
gd_generic_gd32f10x.menu.pnum.GD32F103RF_GENERIC.build.board=GD32F103RF_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103RF_GENERIC.build.series=GD32F10x
gd_generic_gd32f10x.menu.pnum.GD32F103RF_GENERIC.build.product_line=GD32F10X_XD
gd_generic_gd32f10x.menu.pnum.GD32F103RF_GENERIC.build.variant=GD32F103RF_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103RF_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f10x.menu.pnum.GD32F103RG_GENERIC=GD32F103RG (Generic)
gd_generic_gd32f10x.menu.pnum.GD32F103RG_GENERIC.upload.maximum_size=1048576
gd_generic_gd32f10x.menu.pnum.GD32F103RG_GENERIC.upload.maximum_data_size=98304
gd_generic_gd32f10x.menu.pnum.GD32F103RG_GENERIC.build.board=GD32F103RG_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103RG_GENERIC.build.series=GD32F10x
gd_generic_gd32f10x.menu.pnum.GD32F103RG_GENERIC.build.product_line=GD32F10X_XD
gd_generic_gd32f10x.menu.pnum.GD32F103RG_GENERIC.build.variant=GD32F103RG_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103RG_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f10x.menu.pnum.GD32F103RI_GENERIC=GD32F103RI (Generic)
gd_generic_gd32f10x.menu.pnum.GD32F103RI_GENERIC.upload.maximum_size=2097152
gd_generic_gd32f10x.menu.pnum.GD32F103RI_GENERIC.upload.maximum_data_size=98304
gd_generic_gd32f10x.menu.pnum.GD32F103RI_GENERIC.build.board=GD32F103RI_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103RI_GENERIC.build.series=GD32F10x
gd_generic_gd32f10x.menu.pnum.GD32F103RI_GENERIC.build.product_line=GD32F10X_XD
gd_generic_gd32f10x.menu.pnum.GD32F103RI_GENERIC.build.variant=GD32F103RI_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103RI_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f10x.menu.pnum.GD32F103RK_GENERIC=GD32F103RK (Generic)
gd_generic_gd32f10x.menu.pnum.GD32F103RK_GENERIC.upload.maximum_size=3145728
gd_generic_gd32f10x.menu.pnum.GD32F103RK_GENERIC.upload.maximum_data_size=98304
gd_generic_gd32f10x.menu.pnum.GD32F103RK_GENERIC.build.board=GD32F103RK_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103RK_GENERIC.build.series=GD32F10x
gd_generic_gd32f10x.menu.pnum.GD32F103RK_GENERIC.build.product_line=GD32F10X_XD
gd_generic_gd32f10x.menu.pnum.GD32F103RK_GENERIC.build.variant=GD32F103RK_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103RK_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f10x.menu.pnum.GD32F103T4_GENERIC=GD32F103T4 (Generic)
gd_generic_gd32f10x.menu.pnum.GD32F103T4_GENERIC.upload.maximum_size=16384
gd_generic_gd32f10x.menu.pnum.GD32F103T4_GENERIC.upload.maximum_data_size=6144
gd_generic_gd32f10x.menu.pnum.GD32F103T4_GENERIC.build.board=GD32F103T4_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103T4_GENERIC.build.series=GD32F10x
gd_generic_gd32f10x.menu.pnum.GD32F103T4_GENERIC.build.product_line=GD32F10X_MD
gd_generic_gd32f10x.menu.pnum.GD32F103T4_GENERIC.build.variant=GD32F103T4_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103T4_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f10x.menu.pnum.GD32F103T6_GENERIC=GD32F103T6 (Generic)
gd_generic_gd32f10x.menu.pnum.GD32F103T6_GENERIC.upload.maximum_size=32768
gd_generic_gd32f10x.menu.pnum.GD32F103T6_GENERIC.upload.maximum_data_size=10240
gd_generic_gd32f10x.menu.pnum.GD32F103T6_GENERIC.build.board=GD32F103T6_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103T6_GENERIC.build.series=GD32F10x
gd_generic_gd32f10x.menu.pnum.GD32F103T6_GENERIC.build.product_line=GD32F10X_MD
gd_generic_gd32f10x.menu.pnum.GD32F103T6_GENERIC.build.variant=GD32F103T6_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103T6_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f10x.menu.pnum.GD32F103T8_GENERIC=GD32F103T8 (Generic)
gd_generic_gd32f10x.menu.pnum.GD32F103T8_GENERIC.upload.maximum_size=65536
gd_generic_gd32f10x.menu.pnum.GD32F103T8_GENERIC.upload.maximum_data_size=20480
gd_generic_gd32f10x.menu.pnum.GD32F103T8_GENERIC.build.board=GD32F103T8_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103T8_GENERIC.build.series=GD32F10x
gd_generic_gd32f10x.menu.pnum.GD32F103T8_GENERIC.build.product_line=GD32F10X_MD
gd_generic_gd32f10x.menu.pnum.GD32F103T8_GENERIC.build.variant=GD32F103T8_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103T8_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f10x.menu.pnum.GD32F103TB_GENERIC=GD32F103TB (Generic)
gd_generic_gd32f10x.menu.pnum.GD32F103TB_GENERIC.upload.maximum_size=131072
gd_generic_gd32f10x.menu.pnum.GD32F103TB_GENERIC.upload.maximum_data_size=20480
gd_generic_gd32f10x.menu.pnum.GD32F103TB_GENERIC.build.board=GD32F103TB_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103TB_GENERIC.build.series=GD32F10x
gd_generic_gd32f10x.menu.pnum.GD32F103TB_GENERIC.build.product_line=GD32F10X_MD
gd_generic_gd32f10x.menu.pnum.GD32F103TB_GENERIC.build.variant=GD32F103TB_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103TB_GENERIC.upload.openocd_script=target/stm32f1x.cfg
gd_generic_gd32f10x.menu.pnum.GD32F103V8_GENERIC=GD32F103V8 (Generic)
gd_generic_gd32f10x.menu.pnum.GD32F103V8_GENERIC.upload.maximum_size=65536
gd_generic_gd32f10x.menu.pnum.GD32F103V8_GENERIC.upload.maximum_data_size=20480
gd_generic_gd32f10x.menu.pnum.GD32F103V8_GENERIC.build.board=GD32F103V8_GENERIC
gd_generic_gd32f10x.menu.pnum.GD32F103V8_GENERIC.build.series=GD32F10x
gd_generic_gd32f10x.menu.pnum.GD32F103V8_GENERIC.build.product_line=GD32F10X_MD
